package kh.java.type;

/*
 * 변수 : 메모리(RAM)에 한개의 값을 기록하기 위한 공간
 * 1.기본형(Primitive Type)
 * 	- 실제 데이터(값,Literal)를 저장
 * 	- 논리형, 문자형, 숫자형(정수,실수형)등 8개의 기본 자료형이 있다.
 * 	- 각 자료형마다 데이터 저장 크기가 다름
 * 2.참조형(Reference Type)
 * 	- 데이터가 저장된 주소가 저장됨(객체의 주소)
 * 	- 기본형을 제외한 모든 타입(사용자 정의 타입 포함)
 * 	- 4byte로 크기가 지정(1byte = 8bit, 1kb = 1024byte, 1mb = 1024kb, 1gb = 1024mb, 1tb = 1024gb, 1peta, 1exa, 1zetta, 1yotta...) 
 * 
 * 
 * 기본자료형(원시자료형)
 *  1. 문자형   : 한 글자를 표현(2byte=16bit=>0~65535(35536가지 표현)
 *    (char)   ' ' 따옴표로 표현함  
 *  
 *  2. 숫자형
 *    2-1 정수형
 *      - byte  	: 1byte, -128~127(256가지 표현)
 *      - short 	: 2byte, -32,768 ~ 32,767
 *      - int(기본형) : 4byte, -2,147,483,648 ~ 2,147,483,647(약 -21억 ~ 21억)
 *      - long  	: 8byte, -922경 ~ 922경
 *    
 *    
 *    2-2 실수형
 *    	- float			: 4byte, 정밀도 소수점이하 7자리 유효함 
 *      - double(기본)	: 8byte, 정밀도 소수점이하 16자리 유효함
 *  
 *  3. 논리형 : 1byte, true/false
 *  	- 다른 타입 0,1로 대체 불가
 */

public class PrimitiveType {

}
